const { BitField } = require("discord.js")
const moment = require('moment-timezone');

const blackList = [
    '298333126143377419', // 2Tae
    '303065328957784067', // Ensa
    '306680580177657857', // 잼민이스 디 꽝꽝르 어르르 뽀로로
    '340297840712744963', // Happy Angel
    '359615403619516427', // 𝓬𝓱𝓸𝓼𝓪𝓷𝓴𝓻𝓾
    '375278783294341122', // 해준
    '404615239519174678', // 6개월만에 본명인 강혁윤
    '415395433326706688', // 0801
    '416468145524703244', // ! BLACK
    '427119032164941824', // OwnerPower
    '428865804990283779', // 이대만
    '440760122382483466', // 서준
    '456055565962051595', // Deleted User 17828168
    '465740126526373912', // 최플936
    '470518528563216384', // 삼색이
    '485767968869974026', // 네온
    '492194419009650699', // 청테이프
    '493040511569887232', // Jwon
    '495612549127995409', // つ 베프
    '496945218696904705', // 416
    '498822284992315423', // KKYUNG
    '501384055674109952', // Shaker
    '507911080127758346', // 태우
    '511070420179615744', // 류한준
    '511107234608971776', // 땅콩
    '515733500523970594', // 유수정
    '517182152656551966', // 네즈코
    '527688861233578074', // 이승현
    '527740763409350665', // 펩시충 볼리베어(신성)
    '528921715561070594', // 감쟈
    '529979377140891649', // ! LOST
    '530648991613059074', // 진_잠주
    '534202677148647425', // 싹퉁바가지
    '534237409496530965', // 시리
    '537044651459477504', // CARTEL
    '540016222390059018', // ♕무너
    '540515497972727808', // !TOP
    '542337775702245386', // ! LION
    '542620661672312832', // 개인사정으로 잠시 활동 중단합니다.Dm,맨션 못봅니다
    '543739748351606804', // Deleted User 5cee1f71
    '544116861886005259', // 유치원 싸움 1짱
    '544147618729558018', // 복귀 피엔
    '545433624611389451', // ㅡblackㅡ
    '547586808121262080', // 𝐉𝐢 𝐖𝐨𝐧
    '556300258716418050', // RainbowGODPO
    '557801493038759958', // X01X01
    '558509716066795543', // 이쌩쌩이다 인성문제있어?
    '561809805329825799', // 리오니
    '563240569892241409', // 유준
    '572383254397583360', // TeamSD | user
    '576706730495311872', // coupleta
    '578873063513391116', // 굿월드와우
    '579976067637444610', // flash_bomb
    '585744706797830155', // TItanumapple
    '596997938543198257', // Qlssm
    '602459845534416896', // ! 키시 !
    '605583327038144530', // ........
    '609348810921213962', // 건우
    '609357177257328663', // 가라
    '613227359574687745', // KimMoSse
    '617339982033453056', // seize
    '619741257404514357', // 흠메흠메
    '622048175892725786', // 밝은은하
    '622227283054166017', // 응디_77ㅓ억
    '625299782860275722', // wa yangazi
    '628918843045183489', // 실험채
    '634319004671934464', // HIPITINI
    '638314711678582794', // YouTubebentley
    '640425984599785472', // oh my god
    '640794267039694871', // ! 코지
    '641591736438620180', // ! 조마
    '645530359202578443', // 김래혁
    '650280702205755403', // ༺ৡۣ͜͡ৡWONৡۣ͜͡ৡ༻
    '655733457363795980', // 승현
    '659037810992480259', // Dugom
    '660078363997896716', // Faker---Inu
    '660428937213771776', // 한담
    '661110691675242507', // 효모
    '664486712080334885', // 냐냥
    '665972656889266176', // 노을
    '667927803764932659', // 코바시
    '669764831510921217', // 잼민이
    '674237132675481631', // ㅇㅎㅈ
    '675531242846027786', // Deleted User 1c0dc5c7
    '681138538288644101', // LEMON
    '682221881071239234', // 씨잼민(ꥪힷퟤꥰힸퟠꥹힽퟻ)
    '684359991637180491', // 로락
    '685497398113730560', // 토모리
    '686010865333567500', // Deleted User 6bcbcd77
    '687562947790503974', // dwjk64
    '688029278293590032', // 다마스
    '690525243395014716', // ꧁༒•「  미투 」•༒꧂
    '690732528499163186', // skyblue
    '692290446290059325', // 하늘찡
    '692324859224522753', // 컴하는 루트 [root]
    '692942038273884201', // NEON
    '700037067262001756', // Deleted User 241d7c34
    '700115960442388502', // 알케이
    '701362896478929007', // Deleted User 18570abf
    '703074607321579631', // Barong2
    '704708657635393536', // EX™2l_-
    '704930959362883604', // 만두
    '708288349068329080', // 김근태
    '709726424671584336', // . .
    '710041369787367494', // [백골부대]yewto9399
    '710057289125593099', // 승진
    '710106184765407253', // ..;
    '714048051177586710', // maoper
    '715353979365621821', // 임금
    '717375101141778483', // 그람
    '717972065721778249', // YQY
    '719335030182379560', // 악동
    '720593872605937725', // goodwhatthe
    '720631009825259561', // 이미지
    '722050711332061205', // '͡언어도단 최봉달
    '723791515096186901', // ! LOOK AT YOU(꼬꼬)
    '724431478729211975', // Deleted User 12637c24
    '724499829262385172', // :santa:ĹĔÝØŊ:church:
    '724884124451602484', // SAY
    '726333000660418621', // 일반적인 사람새끼
    '728936176383426572', // Swe0y:crown:
    '730224887871832126', // Deleted User f4fba9d9
    '731245602716778529', // Deleted User e658d14d
    '731496615759839304', // 14민수의 귀환
    '732565390672003092', // gangta
    '734347840192643139', // Deleted User 7bc39222
    '734928774528892978', // TRUE
    '737562306728296471', // :woman:🦲:handshake::man:🦲
    '739382915359703040', // killop00
    '739731779195502636', // [AFK]Spirit
    '740087465989242902', // 빅싀비
    '740213372074852384', // ! JS(?)>Python>HTML,CSS
    '740448575930236978', // 흐어 ㅠ
    '740852514328543292', // 나긋해 바보
    '742038608722002020', // 임루팬파포익
    '742329073174577163', // VICKIE
    '742747407854469180', // token
    '742810119665877050', // 근태
    '743101455279587398', // 이름없음
    '743429399956947067', // 하늘입니다
    '745085276954558504', // BEAR
    '747370096082550824', // Deleted User abccf756
    '748913906139005043', // rohcke10
    '749568405299921016', // 017ARYUNG
    '749773835338776576', // 만두 좇병신
    '749974167947968573', // GRT ROSSN
    '750288268989562883', // ㅎㅇㅎㅇ
    '751774719673630750', // 타이머
    '753418918328139899', // 맹구!
    '753807551484919899', // 나긋해 ㅗ
    '753808205548617750', // 나긋해 ㅗㅗㅗㅗㅗㅗㅗ
    '755634547495927818', // gunWo
    '757108508184281160', // 나긋해 강아지
    '757395325970284574', // 계정버림
    '758891650625568809', // 정쥬임니다
    '764331019620188160', // 나긋해 병신새끼
    '764332622796947496', // 나긋해 뒤져라
    '764332975390326855', // 나긋해 애미 뒤져라
    '764333801266085948', // 나긋해 씨발
    '764334265965084702', // 나긋해 병신새끼
    '765861963149475841', // 걍_유저
    '767969439810715658', // 저 사실 지호에요 신고만 하지 말아주세요
    '768100486787104768', // 나긋해 병신새끼 꼭 나가 뒤지세요
    '768101287979122709', // 왜 반응 안하니 나긋해 병신
    '769208755999997962', // 나긋해 병신
    '771735986216501289', // 크시
    '772330880886112316', // 나긋해 걍 병신 뒤저라
    '772334931254575148', // 나긋해병신아니가자유채팅에반응안하면더함
    '772339132877766677', // ㄴㅇㄹ
    '772340864466681866', // 레엉
    '773419190317088769', // 나긋해 병신새끼 겨드랑이 냄세 오지고 섹스
    '777119790111916033', // 보이스 test
    '777715348971454484', // 난굿
    '778929203734642719', // STame
    '778979376037494825', // 민초
    '779220349551509565', // d에
    '780379247050752030', // mindata 샌즈
    '781113259171774475', // Rosolho
    '782588331980357652', // 부산유학
    '782594890403938304', // 몸장대표
    '783845873838719028', // ㅎㅎ
    '772333660623863818',
    '773419577383583794',
    '773420421323292693',
    '773421028662968360',
    '773457637148721153',
]
// const welcomeChannelName = "안녕하세욜" // 입장 시 환영메시지를 전송 할 채널의 이름을 입력하세요.
const welcomeChannelId = 794119277703462942 // 입장 시 환영메시지를 전송 할 채널의 이름을 입력하세요.
const welcomeChannelComment = "어서오세요." // 입장 시 전송할 환영메시지의 내용을 입력하세요.
const roleName = "게스트" // 입장 시 지급 할 역할의 이름을 적어주세요.

module.exports = async (bot, member) => {
    // 가입한지 30분이 지나지 않았고,
    // 아바타 이미지가 없으면 밴.
    let condition1 = moment.duration(moment(new Date()).locale('ko').diff(moment(member.user.createdTimestamp).locale('ko'))).asMinutes() < 30;
    let condition2 = member.user.defaultAvatarURL == member.user.displayAvatarURL();
    let condition3 = member.user.username.indexOf('나긋해') != -1;
    if (condition1) member.ban();
    if (condition1 && condition2) member.ban();

    if (condition3) member.ban();


    const guild = member.guild
    const newUser = member.user
    // const welcomeChannel = guild.channels.cache.find((channel) => channel.name == welcomeChannelName)
    const welcomeChannel = guild.channels.cache.find((channel) => channel.id == welcomeChannelId)

    welcomeChannel.send(`<@${newUser.id}> ${welcomeChannelComment}\n`) // 올바른 채널명을 기입하지 않았다면, Cannot read property 'send' of undefined; 오류가 발생합니다.

    let guestrole = guild.roles.cache.find((r) => r.name === roleName)
    if (!guestrole) {
        try {
            guestrole = await guild.roles.create({
                data: {
                    name: roleName,
                    color: bot.colours.green_light,
                },
                reason: '',
            })
            guestrole.setPermissions(new BitField(0)); // 어떤 권한도 없는 상태
        } catch (e) {
            console.log(e.stack);
        }
    }

    member.roles.add(guestrole.id)


    // let banAlertChannel;
    // if(process.env.NODE_ENV == 'live') {
    //     banAlertChannel = bot.guilds.cache.find(x => x.name == '나긋해_유튜브_채널').channels.cache.find(x => x.name == '경고');
    // }
    // else if(process.env.NODE_ENV == 'qa') {
    //     banAlertChannel = bot.guilds.cache.find(x => x.name == '__youtube_test').channels.cache.find(x => x.name == '일반');
    // }
    // else {
    //     console.log('guildMemberAdd 버그났당..?');
    //     return;
    // }

    for (bl of blackList) {
        let kick_msg = member.user.username + '#' + member.user.discriminator + '이(가) 강퇴시켰습니다.';

        let user = member.guild.members.cache.find(x => x.id == bl)
        if (user) {
            // console.log(user.user)
            // banAlertChannel
            //     .send(`<@${user.id}> ${user.user.username}#${user.user.discriminator}는 블랙리스트에 있는 새끼라서 밴당했습니다.`);
            user.ban(kick_msg)
            // break;
        }
    }
}